; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v8 ?v1)
             (pred_5 ?v5 ?v2)
             (pred_1 ?v8 ?v2)
             (pred_2 ?v4 ?v8 )
	     (pred_4 ?v8)
             (pred_11 ?v13)
             (pred_6 ?v5)
             (pred_3 ?v2)
             (pred_12 ?v8)
             (pred_8 ?v5)
             (pred_10 ?v8)
             (pred_7 ))



(:action op_1
:parameters (?v3 ?v9 ?v12 ?v7)
:precondition (and (pred_11 ?v3) (pred_11 ?v9) (pred_6 ?v12) (pred_3 ?v7)
          (pred_9 ?v3 ?v9) (pred_5 ?v12 ?v7)
                   (pred_1 ?v9 ?v7) (pred_4 ?v3) 
                   (pred_12 ?v9) (pred_8 ?v12))
:effect (and  (pred_10 ?v9) (not (pred_12 ?v9))))


(:action op_4
:parameters (?v3 ?v6)
:precondition (and (pred_11 ?v3) (pred_11 ?v6)
               (pred_4 ?v3) (pred_9 ?v3 ?v6) (pred_10 ?v6))
:effect (and (pred_4 ?v6) (not (pred_4 ?v3))))

(:action op_2
:parameters (?v3 ?v12)
:precondition (and (pred_11 ?v3) (pred_6 ?v12) 
                  (pred_4 ?v3) (pred_2 ?v12 ?v3) (pred_7 ))
:effect (and (pred_8 ?v12)
   (not (pred_2 ?v12 ?v3)) (not (pred_7 ))))


(:action op_5
:parameters (?v3 ?v11 ?v10)
:precondition (and (pred_11 ?v3) (pred_6 ?v11) (pred_6 ?v10)
                  (pred_4 ?v3) (pred_8 ?v10) (pred_2 ?v11 ?v3))
:effect (and (pred_8 ?v11) (pred_2 ?v10 ?v3)
        (not (pred_8 ?v10)) (not (pred_2 ?v11 ?v3))))

(:action op_3
:parameters (?v3 ?v12)
:precondition (and (pred_11 ?v3) (pred_6 ?v12) 
                  (pred_4 ?v3) (pred_8 ?v12))
:effect (and (pred_7 ) (pred_2 ?v12 ?v3) (not (pred_8 ?v12)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_15 obj_25 obj_12 obj_09 obj_31 obj_08 obj_13 obj_17 obj_04 obj_30 obj_16 obj_05 obj_07 obj_26 obj_23 obj_18 obj_27 obj_28 obj_14 obj_01 obj_29 obj_20 obj_10 obj_22
    obj_06 obj_03 obj_21
    obj_02 obj_24 obj_19
    )

    (:init
       (pred_7)

       (pred_11 obj_11)
       (pred_11 obj_15)
       (pred_11 obj_25)
       (pred_11 obj_12)
       (pred_11 obj_09)
       (pred_11 obj_31)
       (pred_11 obj_08)
       (pred_11 obj_13)
       (pred_11 obj_17)
       (pred_11 obj_04)
       (pred_11 obj_30)
       (pred_11 obj_16)
       (pred_11 obj_05)
       (pred_11 obj_07)
       (pred_11 obj_26)
       (pred_11 obj_23)
       (pred_11 obj_18)
       (pred_11 obj_27)
       (pred_11 obj_28)
       (pred_11 obj_14)
       (pred_11 obj_01)
       (pred_11 obj_29)
       (pred_11 obj_20)
       (pred_11 obj_10)
       (pred_11 obj_22)
       (pred_3 obj_06)
       (pred_3 obj_03)
       (pred_3 obj_21)
       (pred_6 obj_02)
       (pred_6 obj_24)
       (pred_6 obj_19)

       (pred_9 obj_11 obj_31)
       (pred_9 obj_11 obj_15)
       (pred_9 obj_15 obj_08)
       (pred_9 obj_15 obj_25)
       (pred_9 obj_15 obj_11)
       (pred_9 obj_25 obj_13)
       (pred_9 obj_25 obj_12)
       (pred_9 obj_25 obj_15)
       (pred_9 obj_12 obj_17)
       (pred_9 obj_12 obj_09)
       (pred_9 obj_12 obj_25)
       (pred_9 obj_09 obj_04)
       (pred_9 obj_09 obj_12)
       (pred_9 obj_31 obj_30)
       (pred_9 obj_31 obj_08)
       (pred_9 obj_31 obj_11)
       (pred_9 obj_08 obj_16)
       (pred_9 obj_08 obj_13)
       (pred_9 obj_08 obj_15)
       (pred_9 obj_08 obj_31)
       (pred_9 obj_13 obj_05)
       (pred_9 obj_13 obj_17)
       (pred_9 obj_13 obj_25)
       (pred_9 obj_13 obj_08)
       (pred_9 obj_17 obj_07)
       (pred_9 obj_17 obj_04)
       (pred_9 obj_17 obj_12)
       (pred_9 obj_17 obj_13)
       (pred_9 obj_04 obj_26)
       (pred_9 obj_04 obj_09)
       (pred_9 obj_04 obj_17)
       (pred_9 obj_30 obj_23)
       (pred_9 obj_30 obj_16)
       (pred_9 obj_30 obj_31)
       (pred_9 obj_16 obj_18)
       (pred_9 obj_16 obj_05)
       (pred_9 obj_16 obj_08)
       (pred_9 obj_16 obj_30)
       (pred_9 obj_05 obj_27)
       (pred_9 obj_05 obj_07)
       (pred_9 obj_05 obj_13)
       (pred_9 obj_05 obj_16)
       (pred_9 obj_07 obj_28)
       (pred_9 obj_07 obj_26)
       (pred_9 obj_07 obj_17)
       (pred_9 obj_07 obj_05)
       (pred_9 obj_26 obj_14)
       (pred_9 obj_26 obj_04)
       (pred_9 obj_26 obj_07)
       (pred_9 obj_23 obj_01)
       (pred_9 obj_23 obj_18)
       (pred_9 obj_23 obj_30)
       (pred_9 obj_18 obj_29)
       (pred_9 obj_18 obj_27)
       (pred_9 obj_18 obj_16)
       (pred_9 obj_18 obj_23)
       (pred_9 obj_27 obj_20)
       (pred_9 obj_27 obj_28)
       (pred_9 obj_27 obj_05)
       (pred_9 obj_27 obj_18)
       (pred_9 obj_28 obj_10)
       (pred_9 obj_28 obj_14)
       (pred_9 obj_28 obj_07)
       (pred_9 obj_28 obj_27)
       (pred_9 obj_14 obj_22)
       (pred_9 obj_14 obj_26)
       (pred_9 obj_14 obj_28)
       (pred_9 obj_01 obj_29)
       (pred_9 obj_01 obj_23)
       (pred_9 obj_29 obj_20)
       (pred_9 obj_29 obj_18)
       (pred_9 obj_29 obj_01)
       (pred_9 obj_20 obj_10)
       (pred_9 obj_20 obj_27)
       (pred_9 obj_20 obj_29)
       (pred_9 obj_10 obj_22)
       (pred_9 obj_10 obj_28)
       (pred_9 obj_10 obj_20)
       (pred_9 obj_22 obj_14)
       (pred_9 obj_22 obj_10)
       (pred_12 obj_09)
       (pred_12 obj_01)
       (pred_12 obj_15)
       (pred_1  obj_09 obj_06)
       (pred_1  obj_01 obj_03)
       (pred_1  obj_15 obj_21)
       (pred_10 obj_11)
       (pred_10 obj_25)
       (pred_10 obj_12)
       (pred_10 obj_31)
       (pred_10 obj_08)
       (pred_10 obj_13)
       (pred_10 obj_17)
       (pred_10 obj_04)
       (pred_10 obj_30)
       (pred_10 obj_16)
       (pred_10 obj_05)
       (pred_10 obj_07)
       (pred_10 obj_26)
       (pred_10 obj_23)
       (pred_10 obj_18)
       (pred_10 obj_27)
       (pred_10 obj_28)
       (pred_10 obj_14)
       (pred_10 obj_29)
       (pred_10 obj_20)
       (pred_10 obj_10)
       (pred_10 obj_22)

       (pred_5  obj_02 obj_06)
       (pred_5  obj_24 obj_03)
       (pred_5  obj_19 obj_21)
       (pred_2 obj_02 obj_12)
       (pred_2 obj_24 obj_29)
       (pred_2 obj_19 obj_04)
       (pred_4 obj_27)
    )

    (:goal (and
       (pred_2 obj_24 obj_10)
    ))
(:constraints
  (always (not (pred_4 obj_20)))
)
)

; plan
1. (op_4 obj_27 obj_18)
   deleted: (pred_4 obj_27)
   added: (pred_4 obj_18)
   goals met: 0 of 1
2. (op_4 obj_18 obj_29)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_29)
   goals met: 0 of 1
3. (op_2 obj_29 obj_24)
   deleted: (pred_2 obj_24 obj_29) (pred_7)
   added: (pred_8 obj_24)
   goals met: 0 of 1
4. (op_4 obj_29 obj_18)
   deleted: (pred_4 obj_29)
   added: (pred_4 obj_18)
   goals met: 0 of 1
5. (op_4 obj_18 obj_27)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_27)
   goals met: 0 of 1
6. (op_4 obj_27 obj_28)
   deleted: (pred_4 obj_27)
   added: (pred_4 obj_28)
   goals met: 0 of 1
7. (op_4 obj_28 obj_10)
   deleted: (pred_4 obj_28)
   added: (pred_4 obj_10)
   goals met: 0 of 1
8. (op_3 obj_10 obj_24)
   deleted: (pred_8 obj_24)
   added: (pred_7) (pred_2 obj_24 obj_10)
   goals met: 1 of 1
